"use strict";
Object.defineProperty(exports, "__esModule", { value: true });
exports.div = void 0;
/**
 * Dhivehi; Maldivian / ދިވެހި
 */
exports.div = {
    ISO6393: "div",
    name: "ދިވެހި",
    type: "list",
    list: {
        replacements: [
            ["ހ", "h"],
            ["ށ", "sh"],
            ["ނ", "n"],
            ["ރ", "r"],
            ["ބ", "b"],
            ["ޅ", "lh"],
            ["ކ", "k"],
            ["އ", "a"],
            ["ވ", "v"],
            ["މ", "m"],
            ["ފ", "f"],
            ["ދ", "dh"],
            ["ތ", "th"],
            ["ލ", "l"],
            ["ގ", "g"],
            ["ޏ", "gn"],
            ["ސ", "s"],
            ["ޑ", "d"],
            ["ޒ", "z"],
            ["ޓ", "t"],
            ["ޔ", "y"],
            ["ޕ", "p"],
            ["ޖ", "j"],
            ["ޗ", "ch"],
            ["ޘ", "tt"],
            ["ޙ", "hh"],
            ["ޚ", "kh"],
            ["ޛ", "th"],
            ["ޜ", "z"],
            ["ޝ", "sh"],
            ["ޞ", "s"],
            ["ޟ", "d"],
            ["ޠ", "t"],
            ["ޡ", "z"],
            ["ޢ", "a"],
            ["ޣ", "gh"],
            ["ޤ", "q"],
            ["ޥ", "w"],
            ["ަ", "a"],
            ["ާ", "aa"],
            ["ި", "i"],
            ["ީ", "ee"],
            ["ު", "u"],
            ["ޫ", "oo"],
            ["ެ", "e"],
            ["ޭ", "ey"],
            ["ޮ", "o"],
            ["ޯ", "oa"],
            ["ް", ""]
        ]
    }
};
//# sourceMappingURL=div.js.map