import { Language } from "..";

/**
 * Georgian / ქართული
 */
export const kat: Language = {
	ISO6393: "kat",
	name: "ქართული",
	type: "list",
	list: {
		replacements: [
			["ა", "a"],
			["ბ", "b"],
			["გ", "g"],
			["დ", "d"],
			["ე", "e"],
			["ვ", "v"],
			["ზ", "z"],
			["თ", "t"],
			["ი", "i"],
			["კ", "k"],
			["ლ", "l"],
			["მ", "m"],
			["ნ", "n"],
			["ო", "o"],
			["პ", "p"],
			["ჟ", "zh"],
			["რ", "r"],
			["ს", "s"],
			["ტ", "t"],
			["უ", "u"],
			["ფ", "ph"],
			["ქ", "q"],
			["ღ", "gh"],
			["ყ", "k"],
			["შ", "sh"],
			["ჩ", "ch"],
			["ც", "ts"],
			["ძ", "dz"],
			["წ", "ts"],
			["ჭ", "tch"],
			["ხ", "kh"],
			["ჯ", "j"],
			["ჰ", "h"]
		]
	}
};
